Repository: Lahiru-Ima/donate-me-app
Catalog: lib/l10n/app_*.arb
Languages: si

# appTitle
source: Donate Me
si: මට දන්ම කරන්න

source: Sign In
si: ප්‍රවේශ වන්න

source: Sign Up
si: ලියාපදිංචි වන්න

source: Create Account
si: ගිණුමක් සාදන්න

source: Email
si: විද්‍යුත් තැපෑල

source: Password
si: මුරපදය

source: Confirm Password
si: මුරපදය තහවුරු කරන්න

source: Full Name
si: සම්පූර්ණ නම

source: Mobile Number
si: ජංගම දුරකථන අංකය

source: Date of Birth
si: උපන් දිනය

source: Gender
si: ස්ත්‍රී පුරුෂභාවය

source: Male
si: පුරුෂ

source: Female
si: ස්ත්‍රී

# enterYourEmail
source: Enter your email address
si: ඔබගේ ඊමේල් ලිපිනය ඇතුල් කරන්න

source: Enter your password
si: ඔබගේ මුරපදය ඇතුල් කරන්න

source: Create a password
si: මුරපදයක් සාදන්න

source: Confirm your password
si: ඔබගේ මුරපදය තහවුරු කරන්න

source: Enter your full name
si: ඔබගේ සම්පූර්ණ නම ඇතුල් කරන්න

source: Enter your mobile number
si: ඔබගේ ජංගම දුරකථන අංකය ඇතුල් කරන්න

source: Select your date of birth
si: ඔබගේ උපන් දිනය තෝරන්න

source: Welcome Back!
si: ආයෙත් සාදරයෙන් පිළිගනිමු!

# signInToContinue
source: Sign in to continue your journey of giving
si: ඔබගේ දන කිරීමේ ගමන දිගටම කරගෙන යාමට ප්‍රවේශ වන්න

# joinUsToday
source: Join us to make a difference today
si: අද අපත් සමඟ වෙනසක් කිරීමට එකතු වන්න

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Sign up here
si: මෙතන ලියාපදිංචි වන්න

source: Sign in here
si: මෙතන ප්‍රවේශ වන්න

# hiUser
source: Hi, {userName}
si: ආයුබෝවන්, {userName}

# makeDifference
source: Make a difference today
si: අද වෙනසක් කරන්න

source: Categories
si: කාණ්ඩ

source: Blood
si: රුධිරය

source: Hair
si: කෙස්

source: Kidney
si: වකුගඩු

source: Fund
si: අරමුදල

source: Create Request
si: ඉල්ලීමක් සාදන්න

source: Create Blood Request
si: රුධිර ඉල්ලීමක් සාදන්න

source: Create Hair Request
si: කෙස් ඉල්ලීමක් සාදන්න

source: Create Kidney Request
si: වකුගඩු ඉල්ලීමක් සාදන්න

source: Create Fund Request
si: අරමුදල් ඉල්ලීමක් සාදන්න

source: Urgent Requests
si: හදිසි ඉල්ලීම්

source: Community Requests
si: ප්‍රජා ඉල්ලීම්

# noRequestsAvailable
source: No {category} requests available
si: {category} ඉල්ලීම් නොමැත

source: Create Donation Request
si: දන ඉල්ලීමක් සාදන්න

source: Request blood donation
si: රුධිර දනයක් ඉල්ලන්න

source: Request hair donation
si: කෙස් දනයක් ඉල්ලන්න

source: Request kidney donation
si: වකුගඩු දනයක් ඉල්ලන්න

source: Request financial assistance
si: මූල්‍ය ආධාරයක් ඉල්ලන්න

source: Cancel
si: අවලංගු කරන්න

# emailRequired
source: Email is required
si: ඊමේල් අවශ්‍යයයි

# validEmailRequired
source: Please enter a valid email address
si: කරුණාකර වලංගු ඊමේල් ලිපිනයක් ඇතුල් කරන්න

# passwordRequired
source: Password is required
si: මුරපදය අවශ්‍යයයි

# passwordMinLength
source: Password must be at least 6 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 6ක් විය යුතුයි

# confirmPasswordRequired
source: Please confirm your password
si: කරුණාකර ඔබගේ මුරපදය තහවුරු කරන්න

source: Passwords do not match
si: මුරපද නොගැලපේ

# fullNameRequired
source: Full name is required
si: සම්පූර්ණ නම අවශ්‍යයයි

# mobileNumberRequired
source: Mobile number is required
si: ජංගම දුරකථන අංකය අවශ්‍යයයි

# validMobileNumber
source: Please enter a valid mobile number
si: කරුණාකර වලංගු ජංගම දුරකථන අංකයක් ඇතුල් කරන්න

# dateOfBirthRequired
source: Date of birth is required
si: උපන් දිනය අවශ්‍යයයි
